Revit 2027 API
BuiltInFailures.KeynoteFailures.NotAssociatedKeynoteParameter Property
 Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotAssociatedKeynoteParameter { get; }
Public Shared ReadOnly Property NotAssociatedKeynoteParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotAssociatedKeynoteParameter {
	FailureDefinitionId^ get ();
}
static member NotAssociatedKeynoteParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeynoteFailures Class
Autodesk.Revit.DB Namespace